"""
Даны два целых числа. Выведите значение наименьшего из них.
"""

a=int(input())
b=int(input())
if a<b:
    print(a)
elif b<a:
    print(b)
else:
    print(a)

"""
Решение разработчиков

a = int(input())
b = int(input())
if a < b:
    print(a)
else:
    print(b)
"""