"""
Дана строка. Замените в этой строке все цифры 1 на слово one.
"""

S = input()
print(S.replace('1','one'))

"""
Решение разработчиков

print(input().replace('1', 'one'))
"""